In [1]:
import pandas as pd
import numpy as np

#### Series can be created using list:(string,integer,boolen,list,tuple,dictionary,float,etc...)

In [2]:
a = ["jack",True,1,['1',1],"Ok",("Good","Morning")]
ser1  = pd.Series(a)
ser1

0               jack
1               True
2                  1
3             [1, 1]
4                 Ok
5    (Good, Morning)
dtype: object

#### We can intialize index by giving index parameter,Values must be hashable and have the same length as data. Non-unique index values are allowed

In [3]:
x=['a','d','b','c',1,2,3]
s=pd.Series(x,index=['A','B','C','D','E','F','F'])
s

A    a
B    d
C    b
D    c
E    1
F    2
F    3
dtype: object

#### Creating Series using numpy array

In [4]:
arr=np.array(['p','b','h','u'])
s1=pd.Series(arr)
s1

0    p
1    b
2    h
3    u
dtype: object

#### Creating Series using Dictionary

In [5]:
d={'name':'a','age':23,'class':4,'bloodgroup':'B'}
s2=pd.Series(d)
s2

name           a
age           23
class          4
bloodgroup     B
dtype: object

#### Accessing index to get its corresponding value

In [6]:
d['class']

4

#### Creating Series from available/defined dictionary keys

In [7]:
d={'name':'arun','surname':'singh','age':23,'class':4,'bloodgroup':'B'}
s2=pd.Series(d,index=['name','surname','bloodgroup'])
s2

name           arun
surname       singh
bloodgroup        B
dtype: object

#### Following two cells show how output look different of Series and dataframe

In [8]:
x=['a','d','b','c',1,2,3]
s=pd.DataFrame(x,index=['A','B','C','D','E','F','G'])
s

   0
A  a
B  d
C  b
D  c
E  1
F  2
G  3

In [9]:
x=['a','d','b','c',1,2,3]
s=pd.Series(x,index=['A','B','C','D','E','F','G'])
s

A    a
B    d
C    b
D    c
E    1
F    2
G    3
dtype: object

#### series can be made by Scaler value

In [10]:
s1=pd.Series(10,index=['A','B','C','D','E','F','G','H','I','J'])
s1

A    10
B    10
C    10
D    10
E    10
F    10
G    10
H    10
I    10
J    10
dtype: int64

In [11]:
#return the shape of Series in tuple
s1.shape

(10,)

In [12]:
s1.dtype

dtype('int64')

In [13]:
s1.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [14]:
s1.values

array([10, 10, 10, 10, 10, 10, 10, 10, 10, 10], dtype=int64)

In [15]:
s1.size

10

In [51]:
s1.empty# check for any blank values

False

In [52]:
s1.hasnans #check nan value

False

In [53]:
s1.ndim

1

In [19]:
#s1.itemsize -check

#### Mapping of Series value by dictionary

In [20]:
x=['a','d','b']
s=pd.Series(x,index=['A','B','C'])
s

A    a
B    d
C    b
dtype: object

In [21]:
s.map({'a':'job','b':'got'})

A    job
B    NaN
C    got
dtype: object

In [22]:
s

A    a
B    d
C    b
dtype: object

#### by giving name parameter to series we can give column name while converting it to dataframe

In [23]:
x=['a','d','b']
s=pd.Series(x,name='column1')
s

0    a
1    d
2    b
Name: column1, dtype: object

In [24]:
s.to_frame()

  column1
0       a
1       d
2       b

In [57]:
x=['a','d','b','b']
s=pd.Series(x)
s

0    a
1    d
2    b
3    b
dtype: object

In [60]:
#Return a Series containing counts of unique rows in the DataFrame.


"""The resulting object will be in descending order so that the first element is the most frequently-occurring element.
    Excludes NA values by default."""

s.value_counts()

b    2
a    1
d    1
dtype: int64

### value_counts have following parameters

    1.sort -> True 
    2.normalize -> With `normalize` set to True,returns the relative frequency by dividing all values by the sum of values.
    3.ascending -> False (by default)
    4.dropna -> With `dropna` set to `False` we can also see NaN index values.
    5.bins -> Bins can be useful for going from a continuous variable to a categorical variable; instead of counting unique apparitions of values, divide the index in the specified number of half-open bins.

### Creating dataframe with list

In [27]:
x=['a','d','b']
s=pd.DataFrame(x)
s

   0
0  a
1  d
2  b

### Creating dataframe with Dictionary

In [28]:
d={'name':['a','b','c'],
  'age':[23,333,45],
  'salary':[1400,4500,3400]}
df=pd.DataFrame(d)
df

  name  age  salary
0    a   23    1400
1    b  333    4500
2    c   45    3400

In [29]:
# providing dictionary values by pandas series and passing Parameter index(userdefined name)

d1={'name':pd.Series(['x','y','z','i'],index=['i1','i2','i3','i4']),
  'age':pd.Series([23,333,45],index=['i1','i2','i3']),
  'salary':pd.Series([1400,4500,3400],index=['i1','i2','i3'])}
df1=pd.DataFrame(d1)
df1

   name    age  salary
i1    x   23.0  1400.0
i2    y  333.0  4500.0
i3    z   45.0  3400.0
i4    i    NaN     NaN

### Creating dataframe with ndarray

In [62]:
# providing columns name by columns parameter

arr1=np.array([['p','b','h','u'],[1,2,3,4],['p','b','h','u'],[1,2,3,4]])
s2=pd.DataFrame(arr1,columns=['i1','i2','i3','i4'])
s2

  i1 i2 i3 i4
0  p  b  h  u
1  1  2  3  4
2  p  b  h  u
3  1  2  3  4

### Creating dataframe with listof lists

In [65]:
arr3=np.array([[11,'Rahul',200],[12,'Raj',300],[13,'Ramesh',200]])
df=pd.DataFrame(arr3,columns=['emp_id','name','salary'])
df

  emp_id    name salary
0     11   Rahul    200
1     12     Raj    300
2     13  Ramesh    200

#### adding new column

In [66]:
df['experience']=pd.Series([3,4,5])

In [67]:
df

  emp_id    name salary  experience
0     11   Rahul    200           3
1     12     Raj    300           4
2     13  Ramesh    200           5

#### changing dtype of columns

In [68]:
dnew={'salary':int}

In [69]:
df=df.astype(dnew)

In [70]:
df['salary'].dtype

dtype('int32')

#### adding new columns with maniplulating of existing df

In [72]:
df['xyz']=df['salary']+df['experience']
df

  emp_id    name  salary  experience  xyz
0     11   Rahul     200           3  203
1     12     Raj     300           4  304
2     13  Ramesh     200           5  205

In [73]:
#del df["inference"]

#### accessing data from columns

In [78]:
df['emp_id']

0    11
1    12
2    13
Name: emp_id, dtype: object

In [80]:
df

  emp_id    name  salary  experience
0     11   Rahul     200           3
1     12     Raj     300           4
2     13  Ramesh     200           5

In [81]:
df.pop('xyz')# removing column by pop method

KeyError: 'xyz'

In [82]:
df

  emp_id    name  salary  experience
0     11   Rahul     200           3
1     12     Raj     300           4
2     13  Ramesh     200           5

In [83]:
df.loc[1]

emp_id         12
name          Raj
salary        300
experience      4
Name: 1, dtype: object

In [44]:
df.loc[[1,2]]

  emp_id    name  salary  experience
1     12     Raj     300           4
2     13  Ramesh     200           5

In [45]:
df[0:3:2]

  emp_id    name  salary  experience
0     11   Rahul     200           3
2     13  Ramesh     200           5

In [46]:
nn=pd.DataFrame([[14,'Ajay',200,6],[15,'Rachel',500,9],[16,'Olive',600,8]],columns=['emp_id','name','salary','experience'])
dfnew=s3.append(nn,ignore_index=True)
dfnew

  emp_id    name  salary  experience
0     11   Rahul     200           3
1     12     Raj     300           4
2     13  Ramesh     200           5
3     14    Ajay     200           6
4     15  Rachel     500           9
5     16   Olive     600           8

In [47]:
dfnew[1:6:2]

  emp_id   name  salary  experience
1     12    Raj     300           4
3     14   Ajay     200           6
5     16  Olive     600           8

In [48]:
dfnew.drop(2)

  emp_id    name  salary  experience
0     11   Rahul     200           3
1     12     Raj     300           4
3     14    Ajay     200           6
4     15  Rachel     500           9
5     16   Olive     600           8